case_turb_conInlet2_0_TurbInlet1_3/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// 1.5*(0.05*1)^2 = 3.7500e-01
k0          0.00375;

internalField   uniform $k0;

boundaryField
{
    inlet1
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }
    inlet2
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }
    outlet
    {
        type            zeroGradient;//inletOutlet;
        inletValue      uniform $k0;
        value           uniform 1;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 0;
/*
        type            fixedValue;
        value           uniform 1e-10;
*/
    }

    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    "procB.*"
    {
        type            processor;
        value           uniform 0;
    }

}


// ************************************************************************* //
