case_turb_conInlet2_0_TurbInlet1_3/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
}

k
{
  boundaryField
  {
      inlet1
      {
          type        fixedValue;
          value       uniform 0.125;
      }

      inlet2
      {
          type        fixedValue;
          value       uniform 0.125;
      }
  }
}




// ************************************************************************* //
